<template>
  <!-- 第一个 停电检测 -->
  <div>
    <dv-scroll-board
        :config="table" ref="scrollBoard"
        style="width: 100%; height: 1100px"
    />
  </div>
</template>

<script setup lang="ts">
import {defineProps, onMounted, onUnmounted, ref} from 'vue';
import axios from 'axios';
const scrollBoard = ref();
const table = ref({
  headerHeight: 50,
  headerBGC: 'rgba(14,183,221,0.8)',
  oddRowBGC: 'rgba(14,183,221,0.3)',
  evenRowBGC: 'rgba(14,183,221,0.4)',
  rowNum: 15,
  index: true,
  header: [
    "隐患编号",
    "项目编码",
    "分部名称",
    "分项名称",
    "隐患级别",
    "隐患类型",
    "说明",
    "隐患编号",
    "项目编码",
    "分部名称",
    "分项名称",
    "隐患级别"
  ],
  data: [
    ['行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行2列1', '行2列2', '行2列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行3列1', '行3列2', '行3列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行4列1', '行4列2', '行4列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行5列1', '行5列2', '行5列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行6列1', '行6列2', '行6列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行7列1', '行7列2', '行7列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行8列1', '行8列2', '行8列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行9列1', '行9列2', '行9列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行10列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行11列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行12列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行13列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行14列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行15列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行16列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行17列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行18列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
    ['行19列1', '行10列2', '行10列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
  ]
});
// 示例方法：更新表格
const updateRows = ref<string[]>([])
async function fetchData() {
  try {
    const res = await axios.get('/citiao/getClientIP');
    const clientIp = res.data.data.clientIp;
    const taskRes =  await axios.post('/citiao/queryTaskByNetWorkIP',{
      clientIp: clientIp
    });
    updateRows.value = taskRes.data.data;
    console.info(updateRows.value);
    doUpdate(updateRows.value, 1);
  } catch (error) {
    console.error("请求失败:", error);
  }
}
const doUpdate = (rows: any[], index: number) => {
  if (scrollBoard.value) {
    scrollBoard.value.updateRows(rows, index);
  }
}
let intervalId: number | null = null;

// onMounted(() => {
//   intervalId = window.setInterval(() => {
//     fetchData();
//   }, 5000); // 每 5 秒执行一次
// });
//
// onUnmounted(() => {
//   if (intervalId !== null) {
//     window.clearInterval(intervalId);
//     intervalId = null;
//   }
// });
</script>